note/2018/who-called-my-function/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-14 Sun 15:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Who Called My Function?</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="/note/style.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/note"> UP </a>
 |
 <a accesskey="H" href="/note"> HOME </a>
</div><div id="content">
<h1 class="title">Who Called My Function?</h1>
<p>
Someone asked who his Emacs starts up with two split screen.
Apparently something in his <code>init.el</code> caused that.
</p>

<p>
But how can we find what caused the problem?
I searched around and found a way to check "backtrace frame" in Emacs: <code>backtrace-frames</code>.
</p>

<p>
Here is what I cooked up:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #79BEEF;">(</span>advice-add 'split-window-right <span style="color: #FE6266;">:before</span> <span style="color: #F975D4;">(</span><span style="color: #46EAFF;">lambda</span> <span style="color: #8AEBB7;">(</span><span style="color: #F975D4;">&amp;rest</span> _<span style="color: #8AEBB7;">)</span> <span style="color: #8AEBB7;">(</span>print <span style="color: #FE6266;">(</span>backtrace-frames<span style="color: #FE6266;">)</span><span style="color: #8AEBB7;">)</span><span style="color: #F975D4;">)</span><span style="color: #79BEEF;">)</span>
<span style="color: #79BEEF;">(</span><span style="color: #46EAFF;">defun</span> <span style="color: #F975D4;">some-function</span> <span style="color: #F975D4;">()</span> <span style="color: #F975D4;">(</span>split-window-right<span style="color: #F975D4;">)</span><span style="color: #79BEEF;">)</span>
</pre>
</div>

<p>
So when I call the function <code>some-funtion</code>,
a split window is created with following information printed:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #79BEEF;">(</span><span style="color: #F975D4;">(</span>t backtrace-frames nil nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>nil print
      <span style="color: #8AEBB7;">(</span><span style="color: #FE6266;">(</span>backtrace-frames<span style="color: #FE6266;">)</span><span style="color: #8AEBB7;">)</span>
      nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t
  <span style="color: #8AEBB7;">(</span><span style="color: #46EAFF;">lambda</span>
    <span style="color: #FE6266;">(</span><span style="color: #F975D4;">&amp;rest</span> _<span style="color: #FE6266;">)</span>
    <span style="color: #FE6266;">(</span>print
     <span style="color: #C792FF;">(</span>backtrace-frames<span style="color: #C792FF;">)</span><span style="color: #FE6266;">)</span><span style="color: #8AEBB7;">)</span>
  nil nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t apply
    <span style="color: #8AEBB7;">(</span><span style="color: #FE6266;">(</span><span style="color: #46EAFF;">lambda</span>
       <span style="color: #C792FF;">(</span><span style="color: #F975D4;">&amp;rest</span> _<span style="color: #C792FF;">)</span>
       <span style="color: #C792FF;">(</span>print
        <span style="color: #FFF100;">(</span>backtrace-frames<span style="color: #FFF100;">)</span><span style="color: #C792FF;">)</span><span style="color: #FE6266;">)</span>
     nil<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t split-window-right nil nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t some-function nil nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t eval
    <span style="color: #8AEBB7;">(</span><span style="color: #FE6266;">(</span>some-function<span style="color: #FE6266;">)</span>
     nil<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t elisp--eval-last-sexp
    <span style="color: #8AEBB7;">(</span>t<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t eval-last-sexp
    <span style="color: #8AEBB7;">(</span>t<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t eval-print-last-sexp
    <span style="color: #8AEBB7;">(</span>nil<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t funcall-interactively
    <span style="color: #8AEBB7;">(</span>eval-print-last-sexp nil<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t call-interactively
    <span style="color: #8AEBB7;">(</span>eval-print-last-sexp nil nil<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span>
 <span style="color: #F975D4;">(</span>t command-execute
    <span style="color: #8AEBB7;">(</span>eval-print-last-sexp<span style="color: #8AEBB7;">)</span>
    nil<span style="color: #F975D4;">)</span><span style="color: #79BEEF;">)</span>
</pre>
</div>

<p>
We can see <code>some-funtion</code> is right before <code>split-window</code>. Cool.
As for the other <code>t</code> and <code>nil</code> stuff, I chose to not bother.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-14 Sun 00:00</p>
<p class="author">Author: Yuan Fu</p>
<p class="date">Created: 2018-10-14 Sun 15:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
